Revit 2027 API
Asset.LibraryName Property
 Library name
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LibraryName { get; }
Public ReadOnly Property LibraryName As String
	Get
public:
property String^ LibraryName {
	String^ get ();
}
member LibraryName : string with get
Property Value
String
See Also
Reference
Asset Class
Autodesk.Revit.DB.Visual Namespace